Script started on Wed 13 Feb 2013 06:48:19 PM PST
[?1034hbash-4.1$ mk list2.c
CSOURCE=list2.c EXECBIN=list2
+ cid + list2.c
+ checksource list2.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 list2.c -o list2 -lm
list2.c: In function â€˜mainâ€™:
list2.c:13: warning: unused parameter â€˜argcâ€™
+ set +x
============================================================
bash-4.1$ valgrind list2 foo bar
==15695== Memcheck, a memory error detector
==15695== Copyright (C) 2002-2010, and GNU GPL'd, by Julian Seward et al.
==15695== Using Valgrind-3.6.0 and LibVEX; rerun with -h for copyright info
==15695== Command: list2 foo bar
==15695== 
0x4c24180->node {word=0x7ff0005d9->[REMOTEHOST=college9-21-187.resnet.ucsc.edu], link=0x4c24130}
0x4c24130->node {word=(nil)->[(null)], link=0x4c240e0}
0x4c240e0->node {word=0x7ff0005d5->[bar], link=0x4c24090}
0x4c24090->node {word=0x7ff0005d1->[foo], link=0x4c24040}
==15695== Conditional jump or move depends on uninitialised value(s)
==15695==    at 0x400663: main (list2.c:22)
==15695== 
==15695== Conditional jump or move depends on uninitialised value(s)
==15695==    at 0x37AAA462AF: vfprintf (vfprintf.c:1595)
==15695==    by 0x37AAA4EA29: printf (printf.c:35)
==15695==    by 0x40064B: main (list2.c:23)
==15695== 
==15695== Use of uninitialised value of size 8
==15695==    at 0x37AAA43761: _itoa_word (_itoa.c:196)
==15695==    by 0x37AAA46367: vfprintf (vfprintf.c:1595)
==15695==    by 0x37AAA4EA29: printf (printf.c:35)
==15695==    by 0x40064B: main (list2.c:23)
==15695== 
==15695== Conditional jump or move depends on uninitialised value(s)
==15695==    at 0x37AAA43768: _itoa_word (_itoa.c:196)
==15695==    by 0x37AAA46367: vfprintf (vfprintf.c:1595)
==15695==    by 0x37AAA4EA29: printf (printf.c:35)
==15695==    by 0x40064B: main (list2.c:23)
==15695== 
==15695== Conditional jump or move depends on uninitialised value(s)
==15695==    at 0x37AAA463C3: vfprintf (vfprintf.c:1595)
==15695==    by 0x37AAA4EA29: printf (printf.c:35)
==15695==    by 0x40064B: main (list2.c:23)
==15695== 
==15695== Conditional jump or move depends on uninitialised value(s)
==15695==    at 0x37AAA4595D: vfprintf (vfprintf.c:1595)
==15695==    by 0x37AAA4EA29: printf (printf.c:35)
==15695==    by 0x40064B: main (list2.c:23)
==15695== 
==15695== Conditional jump or move depends on uninitialised value(s)
==15695==    at 0x37AAA459CE: vfprintf (vfprintf.c:1595)
==15695==    by 0x37AAA4EA29: printf (printf.c:35)
==15695==    by 0x40064B: main (list2.c:23)
==15695== 
0x4c24040->node {word=0x7ff0005cb->[list2], link=0x37aaa0fb88}
==15695== Use of uninitialised value of size 8
==15695==    at 0x40065C: main (list2.c:22)
==15695== 
==15695== Use of uninitialised value of size 8
==15695==    at 0x40061E: main (list2.c:23)
==15695== 
==15695== Use of uninitialised value of size 8
==15695==    at 0x400626: main (list2.c:23)
==15695== 
==15695== Use of uninitialised value of size 8
==15695==    at 0x40062D: main (list2.c:23)
==15695== 
==15695== Invalid read of size 1
==15695==    at 0x37AAA4757C: vfprintf (vfprintf.c:1596)
==15695==    by 0x37AAA4EA29: printf (printf.c:35)
==15695==    by 0x40064B: main (list2.c:23)
==15695==  Address 0xc0012000029d5 is not stack'd, malloc'd or (recently) free'd
==15695== 
==15695== 
==15695== Process terminating with default action of signal 11 (SIGSEGV)
==15695==  General Protection Fault
==15695==    at 0x37AAA4757C: vfprintf (vfprintf.c:1596)
==15695==    by 0x37AAA4EA29: printf (printf.c:35)
==15695==    by 0x40064B: main (list2.c:23)
0x37aaa0fb88->node {word=0xc0012000029d5->[==15695== 
==15695== HEAP SUMMARY:
==15695==     in use at exit: 80 bytes in 5 blocks
==15695==   total heap usage: 5 allocs, 0 frees, 80 bytes allocated
==15695== 
==15695== LEAK SUMMARY:
==15695==    definitely lost: 0 bytes in 0 blocks
==15695==    indirectly lost: 0 bytes in 0 blocks
==15695==      possibly lost: 0 bytes in 0 blocks
==15695==    still reachable: 80 bytes in 5 blocks
==15695==         suppressed: 0 bytes in 0 blocks
==15695== Rerun with --leak-check=full to see details of leaked memory
==15695== 
==15695== For counts of detected and suppressed errors, rerun with: -v
==15695== Use --track-origins=yes to see where uninitialised values come from
==15695== ERROR SUMMARY: 54 errors from 12 contexts (suppressed: 6 from 6)
Segmentation fault (core dumped)
bash-4.1$ gdb kl[K[Klist2
[?1034hGNU gdb (GDB) Red Hat Enterprise Linux (7.2-50.el6)
Copyright (C) 2010 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-redhat-linux-gnu".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from /afs/cats.ucsc.edu/users/j/dwoodbur/private/cmps012b/lab5/list2...done.
(gdb) run foo bar
Starting program: /afs/cats.ucsc.edu/users/j/dwoodbur/private/cmps012b/lab5/list2 foo bar
0x601090->node {word=0x7fffffffe615->[REMOTEHOST=college9-21-187.resnet.ucsc.edu], link=0x601070}
0x601070->node {word=(nil)->[(null)], link=0x601050}
0x601050->node {word=0x7fffffffe611->[bar], link=0x601030}
0x601030->node {word=0x7fffffffe60d->[foo], link=0x601010}
0x601010->node {word=0x7fffffffe5cd->[/afs/cats.ucsc.edu/users/j/dwoodbur/private/cmps012b/lab5/list2], link=0x37aaa0fb88}

Program received signal SIGSEGV, Segmentation fault.
0x00000037aaa4757c in _IO_vfprintf_internal (s=<value optimized out>, format=<value optimized out>, ap=<value optimized out>) at vfprintf.c:1596
1596		  process_string_arg (((struct printf_spec *) NULL));
(gdb) where
#0  0x00000037aaa4757c in _IO_vfprintf_internal (s=<value optimized out>, format=<value optimized out>, ap=<value optimized out>) at vfprintf.c:1596
#1  0x00000037aaa4ea2a in __printf (format=<value optimized out>) at printf.c:35
#2  0x000000000040064c in main (argc=3, argv=0x7fffffffe308) at list2.c:23
(gdb) list
1591	
1592	      /* Process current format.  */
1593	      while (1)
1594		{
1595		  process_arg (((struct printf_spec *) NULL));
1596		  process_string_arg (((struct printf_spec *) NULL));
1597	
1598		LABEL (form_unknown):
1599		  if (spec == L_('\0'))
1600		    {
(gdb) list list2.c:23
18	      node->word = argv[argi];
19	      node->link = head;
20	      head = node;
21	   }
22	   for (node *curr = head; curr->link != NULL; curr = curr->link) {
23	      printf ("%p->node {word=%p->[%s], link=%p}\n",
24	              curr, curr->word, curr->word, curr->link);
25	   }
26	   return 9;
27	}
(gdb) print head
No symbol "head" in current context.
(gdb) bt
#0  0x00000037aaa4757c in _IO_vfprintf_internal (s=<value optimized out>, format=<value optimized out>, ap=<value optimized out>) at vfprintf.c:1596
#1  0x00000037aaa4ea2a in __printf (format=<value optimized out>) at printf.c:35
#2  0x000000000040064c in main (argc=3, argv=0x7fffffffe308) at list2.c:23
(gdb) up
#1  0x00000037aaa4ea2a in __printf (format=<value optimized out>) at printf.c:35
35	  done = vfprintf (stdout, format, arg);
(gdb) up
#2  0x000000000040064c in main (argc=3, argv=0x7fffffffe308) at list2.c:23
23	      printf ("%p->node {word=%p->[%s], link=%p}\n",
(gdb) up
Initial frame selected; you cannot go up.
(gdb) print head
$1 = (node *) 0x601090
(gdb) print *head
$2 = {word = 0x7fffffffe615 "REMOTEHOST=college9-21-187.resnet.ucsc.edu", link = 0x601070}
(gdb) print *(head->word([K)
$3 = 82 'R'
(gdb) print head->link->link->link
$4 = (node *) 0x601030
(gdb) print *(head->link->link->link)
$5 = {word = 0x7fffffffe60d "foo", link = 0x601010}
(gdb) exit
Undefined command: "exit".  Try "help".
(gdb) e[Kquit
A debugging session is active.

	Inferior 1 [process 15706] will be killed.

Quit anyway? (y or n) y
bash-4.1$ exit
exit

Script done on Wed 13 Feb 2013 06:51:09 PM PST
