Script started on Wed 13 Feb 2013 06:51:33 PM PST
[?1034hbash-4.1$ gdb list2
[?1034hGNU gdb (GDB) Red Hat Enterprise Linux (7.2-50.el6)
Copyright (C) 2010 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-redhat-linux-gnu".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from /afs/cats.ucsc.edu/users/j/dwoodbur/private/cmps012b/lab5/list2...done.
(gdb) break main
Breakpoint 1 at 0x4005a4: file list2.c, line 15.
(gdb) run foo bar
Starting program: /afs/cats.ucsc.edu/users/j/dwoodbur/private/cmps012b/lab5/list2 foo bar

Breakpoint 1, main (argc=3, argv=0x7fffffffe308) at list2.c:15
15	   for (int argi = 0; argi < 5; ++argi) {
(gdb) print argc
$1 = 3
(gdb) print argv
$2 = (char **) 0x7fffffffe308
(gdb) print argv[0]
$3 = 0x7fffffffe5cd "/afs/cats.ucsc.edu/users/j/dwoodbur/private/cmps012b/lab5/list2"
(gdb) print argv[0][K[K1]
$4 = 0x7fffffffe60d "foo"
(gdb) print argv[1][K[K2]
$5 = 0x7fffffffe611 "bar"
(gdb) print argv[2][K[K3]
$6 = 0x0
(gdb) print argv[3][K[K4]
$7 = 0x7fffffffe615 "REMOTEHOST=college9-21-187.resnet.ucsc.edu"
(gdb) print argv[4][K[K5]
$8 = 0x7fffffffe640 "HOSTNAME=unix2.ic.ucsc.edu"
(gdb) print argv[5][K[K6]
$9 = 0x7fffffffe65b "autologout=180"
(gdb) exit
Undefined command: "exit".  Try "help".
(gdb) quit
A debugging session is active.

	Inferior 1 [process 15963] will be killed.

Quit anyway? (y or n) y
bash-4.1$ exit
exit

Script done on Wed 13 Feb 2013 06:54:23 PM PST
